adem-marangoz/embedde_system_online_diploma/unit_10/codes/Stm32f10xx_I2C.c
/**
 * @file Stm32f10xx_I2C.c
 * @author adem alnajjar (adem.marangoz95@gamil.com)
 * @brief The I2C API
 * @version 0.1
 * @date 2022-09-17
 * 
 * @copyright Copyright (c) 2022
 * 
 */

//______________________________ Include Files _________________________________
#include "Stm32f10xx_I2C.h"
#include "Stm32f10xx_GPIO.h"
#include "Stm32f10xx_RCC.h"
#include <stdio.h>

//==============================================================================


//______________________________ Generic Macro _________________________________

//==============================================================================


//_________________ Decleration Local Functions & Variables ____________________
uint8_t I2C_Clock_Config_Pins(St_I2C_API *I2Cx);
//==============================================================================


//______________________________ External Objects ______________________________
extern St_I2C_API i2c1_config;
extern St_I2C_API i2c2_config;
//==============================================================================


//______________________________ Global Function _______________________________

/**
 * @brief Is used to Config I2C
 * @param I2Cx : data Structure for I2C API
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Init(St_I2C_API *I2Cx)
{
    if(I2Cx->I2C_Modes == I2C_Mode)
    {
        // Check Inputs data to I2C structure
        if(!(IS_I2C_ALL_INSTANCE(I2Cx->I2C_Inst))){return 0;}
        if(!(IS_STRECTCH_ALL(I2Cx->No_Stretch))){return 0;}
        if(!(IS_GENERAL_CALL_ALL(I2Cx->Gneral_Call_En))){return 0;}
        if(!(IS_I2C_MODE_ALL(I2Cx->I2C_Master_Mode))){return 0;}
        if(!(IS_I2C_RX_INTERUPT(I2Cx->RX_Intrrupt_En))){return 0;}
        if(!(IS_I2C_EVENT_INTERRUPT(I2Cx->Event_Interrupt_En))){return 0;}
        if(!(IS_I2C_ERR_INTERRUPT(I2Cx->Error_Interrupt_En))){return 0;}
        // if(!(IS_SLAVE_ADDRESS_MODE(I2Cx->Slave_Address->Address_mode))){return 0;}
        // if(!(IS_DUAL_ADDRESS_ALL(I2Cx->Slave_Address->Dual_address))){return 0;}
        if(!(IS_MASTER_SPEED_MODE(I2Cx->I2C_Master_Mode))){return 0;}
        if(!(IS_FM_DUTY_MODE(I2Cx->FM_Duty_Mode))){return 0;}

        //Initially giving base functions addresses values
        if(I2Cx->P_SB_CallBack == NULL){I2Cx->P_SB_CallBack = SB_CallBack_I2C;}
        if(I2Cx->P_ADDR_CallBack == NULL){I2Cx->P_ADDR_CallBack = ADDR_CallBack_I2C;}
        if(I2Cx->P_ADDR10_CallBack == NULL){I2Cx->P_ADDR10_CallBack = ADDR10_CallBack_I2C;}
        if(I2Cx->P_SB_CallBack == NULL){I2Cx->P_SB_CallBack = STOPF_CallBack_I2C;}
        if(I2Cx->P_BTF_CallBack == NULL){I2Cx->P_BTF_CallBack = BTF_CallBack_I2C;}
        if(I2Cx->P_TXE_CallBack == NULL){I2Cx->P_TXE_CallBack = TXE_CallBack_I2C;}
        if(I2Cx->P_RXNE_CallBack == NULL){I2Cx->P_RXNE_CallBack = RXNE_CallBack_I2C;}
        if(I2Cx->P_OVR_CallBack == NULL){I2Cx->P_OVR_CallBack = OVR_CallBack_I2C;}
        if(I2Cx->P_TIMEOUT_CallBack == NULL){I2Cx->P_TIMEOUT_CallBack = TIMEOUT_CallBack_I2C;}
        if(I2Cx->P_AF_CallBack == NULL){I2Cx->P_AF_CallBack = AF_CallBack_I2C;}
        

        
        // Confige Peripheral Clock Freq
        uint32_t PCLK1 = Get_APB1_Freq();
        uint32_t temp_freq = 0;
        if(I2Cx->Peripheral_Input_Freq < PCLK1)
        {
            
            // Check peripheral clock input with user clock Master clock mode
            if(I2Cx->I2C_Master_Mode == I2C_Master_SM_Mode)
            {
                if(I2Cx->Peripheral_Input_Freq < I2C_Peripheral_input_Freq_2M){return 0;}
            }else
            {
                if(I2Cx->Peripheral_Input_Freq < I2C_Peripheral_input_Freq_4M){return 0;}
            }

            // To config The Peripheral input clock
            I2Cx->I2C_Inst->I2C_CR2 &= ~(I2C_CR2_FREQ);
            temp_freq = (PCLK1 >> 6) & 0x3F;
            I2Cx->I2C_Inst->I2C_CR2 |= temp_freq;
        }else
        {
            return 0;
        }

        // Config I2C SCL Freq base on the Fm or Sm
        if(I2Cx->I2C_Master_Mode == I2C_Master_SM_Mode)
        {
            if(I2Cx->SCL_Freq >= I2C_SCL_SM_Freq_MAX)
            {
                // uint16_t temp = (PCLK1)/(2*I2Cx->SCL_Freq);
                // temp &= 0x0FFF;
                I2Cx->I2C_Inst->I2C_CCR |= (PCLK1)/(2*I2Cx->SCL_Freq);
            }else
            {
                return 0;
            }
        }else
        {
            if(I2Cx->SCL_Freq >= I2C_SCL_FM_Freq_MAX)
            {
                if(I2Cx->FM_Duty_Mode == I2C_FM_Duty_2)
                {
                    I2Cx->I2C_Inst->I2C_CCR |= (uint16_t)((PCLK1)/(3*I2Cx->SCL_Freq));
                }else
                {
                    I2Cx->I2C_Inst->I2C_CCR |= (uint16_t)((PCLK1)/(25*I2Cx->SCL_Freq));
                }
            }else
            {
                return 0;
            }
        }

        // Config The Maximum rise time in Fm/Sm mode
        I2Cx->I2C_Inst->I2C_TRISE &= ~(I2C_TRISE_F_S);
        I2Cx->I2C_Inst->I2C_TRISE |= temp_freq + (uint32_t)1;

        // Set Slave Addressing 1 and select Slave address length
        // I2Cx->I2C_Inst->I2C_OAR1 |= (I2Cx->Slave_Address->Slave_Address1) | (I2Cx->Slave_Address->Address_mode);

        // Select Dual slave Addressing
        // I2Cx->I2C_Inst->I2C_OAR2 |= (I2Cx->Slave_Address->Slave_Address2) | (I2Cx->Slave_Address->Dual_address);

        // Select Rx and Event and Error and Peripheral clock Frequency
        I2Cx->I2C_Inst->I2C_CR2 |= (I2Cx->RX_Intrrupt_En) | (I2Cx->Event_Interrupt_En) | (I2Cx->Error_Interrupt_En) | (I2Cx->Peripheral_Input_Freq);

        // Select F/S & I2C Duty
        I2Cx->I2C_Inst->I2C_CCR |= (I2Cx->I2C_Master_Mode) | (I2Cx->FM_Duty_Mode);

        
        // Set ACK when receive data
        I2Cx->I2C_Inst->I2C_CR1 |= I2C_CR1_ACK | I2Cx->Gneral_Call_En | I2Cx->No_Stretch;

        // Config I2C Pins and Enable I2C clock
        I2C_Clock_Config_Pins(I2Cx);

        // Enable I2C IRQ
        if(I2Cx->RX_Intrrupt_En)
        {
            if(I2Cx->I2C_Inst == I2C1){NVIC_EnableIRQ(I2C1_EV_IRQn);}
            if(I2Cx->I2C_Inst == I2C2){NVIC_EnableIRQ(I2C2_EV_IRQn);}
        }

        if(I2Cx->Error_Interrupt_En)
        {
            if(I2Cx->I2C_Inst == I2C1){NVIC_EnableIRQ(I2C1_ER_IRQn);}
            if(I2Cx->I2C_Inst == I2C2){NVIC_EnableIRQ(I2C2_ER_IRQn);}
        }

        // Set I2C peripheral
        I2Cx->I2C_Inst->I2C_CR1 |= I2C_CR1_PE;

        return 1;
    }else
    {
        // Yet this API is not support SMBus 
        // TODO SMBus configurtion 
        return 0;
    }

