adem-marangoz/embedde_system_online_diploma/unit_10/codes/Stm32f10xx_I2C.c
}

/**
 * @brief Is Used to Reset Config I2C Peripheral
 * @param I2Cx : data Structure for I2C API
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Deinit(St_I2C_API *I2Cx)
{
    if(I2Cx->I2C_Inst == I2C1)
    {
        __APB1RSTR_I2C1RST();
        NVIC_DisableIRQ(I2C1_ER_IRQn);
        NVIC_DisableIRQ(I2C1_EV_IRQn);
    }else
    {
        __APB1RSTR_I2C2RST();
        NVIC_DisableIRQ(I2C2_ER_IRQn);
        NVIC_DisableIRQ(I2C2_EV_IRQn);
    }
}


/**
 * @brief Is Used to Send data form Master to Slave
 * @param I2Cx : data Structure for I2C API
 * @param Add   : The Slave Address
 * @param Tx_Buf    : The Pointer indicating the data to be sent
 * @param data_len : The Length Data of want send
 * @param Stop_cond : condition for send stop condition after send data
 * @param Repeat_start : condition to repate send Start condition or not
 * @param I2Cpollingx : Not used Yet
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Master_Write(St_I2C_API *I2Cx, uint16_t Add, uint8_t *Tx_Buf, uint8_t data_len,\
                        En_I2C_Stop_condition Stop_cond, En_I2C_RepeatStart Repeat_start,\
                        enum I2C_Polling polling)
{
    // Generate Start Condition
    I2C_GenerateStart(I2Cx,Start,Fun_St_En);

    // Check if SB is Set
    while(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_SB));
    
    uint32_t dummy_read = I2Cx->I2C_Inst->I2C_SR1;

    // Write Device Address to I2C_DR
    I2C_Send_Add(I2Cx, Add, I2C_Write);

    // Read ADDR Bit in I2C_SR1 register
    while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_ADDR)));

    // Check MSL , BUSY, TRA and TXE flags
    while(!(I2C_Get_FlagStatus(I2Cx, Master_Byet_Transmitting)));


    while(data_len)
    {
        // Write Data to I2C_Dr
        I2Cx->I2C_Inst->I2C_DR = *Tx_Buf;
        
        // Wait until Set TxE flag
        while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_TXE)));
        Tx_Buf++;
        data_len--;
    }

    if(Stop_cond == I2C_With_Stop)
    {
        I2C_GenerateStop(I2Cx,Fun_St_En);
    }else
    {
        return 0 ;
    }
}

/**
 * @brief Is Used to send Stop condition form master 
 * @param I2Cx : data Structure for I2C API
 * @param FunctionState Is used to Clear Or Set Stop conditon in I2C_CR1 register
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_GenerateStop(St_I2C_API *I2Cx, En_FunctionState FunctionState)
{
    if(FunctionState == Fun_St_En)
    {
        I2Cx->I2C_Inst->I2C_CR1 |= I2C_CR1_STOP;
    }else
    {
        I2Cx->I2C_Inst->I2C_CR1 &= ~(I2C_CR1_STOP);
    }

    return 1;
}

/**
 * @brief Is Used to Send Device Address via SDA to Slave
 * @param I2Cx : data Structure for I2C API
 * @param Add : The Device Address
 * @param direction : Determining the mode of the master while sending the address of the slave
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed 
 */
uint8_t I2C_Send_Add(St_I2C_API *I2Cx, uint16_t Add, En_I2C_direction direction)
{  
    Add = (Add << 1);
    //if Address mode is 10 bit
    if((I2Cx->Slave_Address->Address_mode & I2C_Slave_Add_10) == I2C_Slave_Add_10)
    {
        // Send Header to Slave
        uint8_t temp_add = (uint8_t)(Add >> 8);
        temp_add = temp_add & 0x06;
        temp_add |= (0xF0 | temp_add);
        I2Cx->I2C_Inst->I2C_DR = (uint8_t)(temp_add | direction);
        while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_ADD10)));         
         // Send Address to Slave 
        I2Cx->I2C_Inst->I2C_DR = (uint8_t)Add;  

    }else
    {
        // Write Device Address with I2C Direction transimitter or receiver
        I2Cx->I2C_Inst->I2C_DR = (Add | direction);  
    }

    return 1;
}


/**
 * @brief Is Used to Receive data form Slave to master
 * @param I2Cx : data Structure for I2C API
 * @param Add   : The Slave Address
 * @param Tx_Buf    : The Pointer indicating the data to be receive
 * @param data_len : The Length Data of want send
 * @param Stop_cond : condition for send stop condition after send data
 * @param Repeat_start : condition to repate send Start condition or not
 * @param I2Cpollingx : Not used Yet
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Master_Read(St_I2C_API *I2Cx, uint16_t Add, uint8_t *Tx_Buf, uint8_t data_len,\
                        En_I2C_Stop_condition Stop_cond, En_I2C_RepeatStart Repeat_start,\
                        enum I2C_Polling polling)
{
    // Generate Start Condition
    I2C_GenerateStart(I2Cx,Repeat_start,Fun_St_En);

    // Check if SB is Set
    while(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_SB));
    
    uint32_t dummy_read = I2Cx->I2C_Inst->I2C_SR1;

    // Write Device Address to I2C_DR
    I2C_Send_Add(I2Cx, Add, I2C_Read);

    // Read ADDR To Reset in I2C_SR1 register
    while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_ADDR)));

    // Read sended Data form Slave
    while(data_len)
    {
        // Wait until Set RXNE flag
        while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_RXNE)));

        // Read I2C_DR and write to Buffer
        *Tx_Buf = I2Cx->I2C_Inst->I2C_DR;
        Tx_Buf++;
        data_len--;
    }

    // Disable ACK to Stop Receive data form Slave
    I2C_Disable_ACK(I2Cx);

    // Read Last Received Data from Slave
    *Tx_Buf = I2Cx->I2C_Inst->I2C_DR;

    // Send Stop Condition
    if(Stop_cond == I2C_With_Stop)
    {
        I2C_GenerateStop(I2Cx, Fun_St_En);
    }

    // Return Set ACK I2C
    I2C_Enable_ACK(I2Cx);

    return 1;
}

/**
 * @brief Is used to transmit data form slave by Interrupt mode
 * @param I2Cx : data Structure for I2C API
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Slave_Write_IT(St_I2C_API *I2Cx)
{
    // Write data to I2C_DR data register
    uint32_t temp = *(I2Cx->Tx_Buff);
    I2Cx->I2C_Inst->I2C_DR = temp;
    (I2Cx->Tx_Buff)++;
}


/**
 * @brief Is Used to Receive data form Master to slave by Interrupt
 * @param I2Cx : data Structure for I2C API
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Slave_Read_IT(St_I2C_API *I2Cx)
{
    I2Cx->Rx_Buff = I2Cx->I2C_Inst->I2C_DR;
    (I2Cx->Rx_Buff)++;
    // return received data form Master
    return (uint8_t)I2Cx->I2C_Inst->I2C_DR;
}


/**
 * @brief Is Used to Transimit data from slave to master by polling mechanics 
 * @param I2Cx : data Structure for I2C API
 * @param data : The Pointer indicating the data to be sent
 * @param data_length : The length of data to wand send
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Slave_Write(St_I2C_API *I2Cx, uint8_t *data, uint8_t data_length)
{
    // Wait until Set ADDR bit in I2C_SR1 register
    while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_ADDR)));

    uint32_t dummy_read = I2Cx->I2C_Inst->I2C_SR2;

    while (data_length)
    {
        // Wait until Set TXE bit in I2C_SR1 register
        while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_TXE)));

        I2Cx->I2C_Inst->I2C_DR = *data;
        data++;
        data_length--;
    }

    // When Master Send NACK is set by hardware AF(Acknowledge Failure) bit in I2C_SR1
    // Must Clear AF bit 
    I2Cx->I2C_Inst->I2C_SR1 &= ~(I2C_SR1_AF); 

