adem-marangoz/embedde_system_online_diploma/unit_10/codes/Stm32f10xx_I2C.c
}


/**
 * @brief Is used to Receive data form master by polline  mechanics
 * @param I2Cx : data Structure for I2C API
 * @param data : The Pointer indicating the data to be received
 * @param data_length : The Length Data of want receive
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Slave_Read(St_I2C_API *I2Cx, uint8_t *data, uint8_t data_length)
{
    // Wait until Set ADDR bit in I2C_SR1 register
    while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_ADDR)));

    while(data_length)
    {
        // Wait until Set RXNE bit in I2C_SR1 register
        while(!(I2C_Get_FlagStatus(I2Cx, I2C_FLAG_RXNE)));
        
        // Write data to Buffer
        *data = I2Cx->I2C_Inst->I2C_DR;
        data++;
        data_length--;
    }

}


/**
 * @brief Is Used to generate The START condition By master
 * @param I2Cx : data Structure for I2C API
 * @param Repeat_start : condition to repate send Start condition or not
 * @param FunctionState : Is used to repate send start condition or not
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_GenerateStart(St_I2C_API *I2Cx, En_I2C_RepeatStart Repeat_start,En_FunctionState FunctionState)
{
    if (Repeat_start == Start)
    {
        // Check if the I2C bus if Busy by detection of SDA or SCL
        while (I2C_Get_FlagStatus(I2Cx, I2C_FLAG_BUSY));
    }else
    {

    }

    // For Check to Generate Start condition
    if(FunctionState == Fun_St_En)
    {
        I2Cx->I2C_Inst->I2C_CR1 |= I2C_CR1_START;
    }else
    {
        I2Cx->I2C_Inst->I2C_CR1 &= ~(I2C_CR1_START);
    }
    return 1;
}


/**
 * @brief Is Used to check flags after doing any process
 * @param I2Cx : data Structure for I2C API
 * @param Flag : flag to check
 * @return En_I2C_FlagState  : Return the state of the flag 
 *                         0 : Reset
 *                         1 : Set
 */
En_I2C_FlagState I2C_Get_FlagStatus(St_I2C_API *I2Cx,EN_I2C_Flag Flag)
{
    En_I2C_FlagState Flag_state = Reset;
    uint32_t flag1 = 0, flag2 = 0, lastevent = 0;
    // To Check Flag state
    switch (Flag)
    {
        case I2C_FLAG_MSL:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_MSL) == I2C_SR2_MSL) {Flag_state = Set;}
            break;
        case I2C_FLAG_BUSY:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_BUSY) == I2C_SR2_BUSY) {Flag_state = Set;}
            break;
        case I2C_FLAG_TRA:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_TRA) == I2C_SR2_TRA) {Flag_state = Set;}
            break;
        case I2C_FLAG_GENCALL:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_GENCALL) == I2C_SR2_GENCALL) {Flag_state = Set;}
            break;
        case I2C_FLAG_SMBDEFAULT:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_SMBDEFAULT) == I2C_SR2_SMBDEFAULT) {Flag_state = Set;}
            break;
        case I2C_FLAG_SMBHOST:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_SMBHOST) == I2C_SR2_SMBHOST) {Flag_state = Set;}
            break;
        case I2C_FLAG_DUALF:
            if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_DUALF) == I2C_SR2_DUALF) {Flag_state = Set;}
            break;
        case I2C_FLAG_SB:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_SB) == I2C_SR1_SB) {Flag_state = Set;}
            break;
        case I2C_FLAG_ADDR:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_ADDR) == I2C_SR1_ADDR) 
            {
                Flag_state = Set;
                flag2 = I2Cx->I2C_Inst->I2C_SR2;
            }else
            {
                Flag_state = Reset;
            }
            break;
        case I2C_FLAG_BTF:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_BTF) == I2C_SR1_BTF) {Flag_state = Set;}
            break;
        case I2C_FLAG_ADD10:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_ADD10) == I2C_SR1_ADD10) {Flag_state = Set;}
            break;
        case I2C_FLAG_STOPF:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_STOPF) == I2C_SR1_STOPF) {Flag_state = Set;}
            break;
        case I2C_FLAG_RXNE:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_RXNE) == I2C_SR1_RXNE) {Flag_state = Set;}
            break;
        case I2C_FLAG_TXE:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_TXE) == I2C_SR1_TXE) {Flag_state = Set;}
            break;
        case I2C_FLAG_BERR:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_BERR) == I2C_SR1_BERR) {Flag_state = Set;}
            break;
        case I2C_FLAG_ARLO:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_ARLO) == I2C_SR1_ARLO) {Flag_state = Set;}
            break;
        case I2C_FLAG_AF:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_AF) == I2C_SR1_AF) {Flag_state = Set;}
            break;
        case I2C_FLAG_OVR:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_OVR) == I2C_SR1_OVR) {Flag_state = Set;}
            break;
        case I2C_FLAG_PECERR:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_PECERR) == I2C_SR1_PECERR) {Flag_state = Set;}
            break;
        case I2C_FLAG_TIMEOUT:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_TIMEOUT) == I2C_SR1_TIMEOUT) {Flag_state = Set;}
            break;
        case I2C_FLAG_SMBALERT:
            if((I2Cx->I2C_Inst->I2C_SR1 & I2C_SR1_SMBALERT) == I2C_SR1_SMBALERT) {Flag_state = Set;}
            break;
        case Master_Byet_Transmitting:
            flag1 = I2Cx->I2C_Inst->I2C_SR1;
            flag2 = I2Cx->I2C_Inst->I2C_SR2;
            flag2 = flag2 << 16;
            lastevent = (flag1 | flag2) & ((uint32_t)0x00FFFFFF);
            if((lastevent & Flag) == Flag)
            {
                Flag_state = Set;
            }else
            {
                Flag_state = Reset;
            }
            break;
        default:
            break;
    }
    return Flag_state;
}


/**
 * @brief Is Used to active the ACK bit
 * @param I2Cx : data Structure for I2C API
 */
void I2C_Enable_ACK(St_I2C_API *I2Cx)
{
    I2Cx->I2C_Inst->I2C_CR1 |= I2C_CR1_ACK;
}

/**
 * @brief Is used to Reset The ACK bit
 * @param I2Cx : data Structure for I2C API
 */
void I2C_Disable_ACK(St_I2C_API *I2Cx)
{
    I2Cx->I2C_Inst->I2C_CR1 &= ~(I2C_CR1_ACK);
}


/**
 * @brief Start condtion Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void SB_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    UNUSED(I2Cx);
}


/**
 * @brief ADDR Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void ADDR_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    uint32_t dummy_read = I2Cx->I2C_Inst->I2C_SR1;
    dummy_read = I2Cx->I2C_Inst->I2C_SR2;
    if(I2C_Get_FlagStatus(I2Cx, I2C_SR2_MSL)) // if Master Mode
    {

        // I2C_Master_Write_IT(I2Cx);
    }else // If Slave Mode
    {
        if(!(I2C_Get_FlagStatus(I2Cx, I2C_SR2_TRA))) // if Transmitter Mode
        {
            I2C_Slave_Write_IT(I2Cx);
        }else // if Receiver Mode
        {

