adem-marangoz/embedde_system_online_diploma/unit_10/codes/Stm32f10xx_I2C.c
        }
    }
    UNUSED(I2Cx);
}


/**
 * @brief ADDR10 Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void ADDR10_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    uint32_t dummy_read = I2Cx->I2C_Inst->I2C_SR1;
    // Now the Master Not doing anything until to send address to Slave and set ADDR
    UNUSED(I2Cx);
}


/**
 * @brief Stop condtion Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void STOPF_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    UNUSED(I2Cx);
}


/**
 * @brief BTF Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void BTF_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    UNUSED(I2Cx);
}


/**
 * @brief TxE empty Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void TXE_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    if(I2C_Get_FlagStatus(I2Cx, I2C_SR2_MSL))
    {
        // For Master
    }else
    {
        if(!(I2C_Get_FlagStatus(I2Cx, I2C_SR2_TRA)))
        {
            I2C_Slave_Write_IT(I2Cx);
        }
    }
    UNUSED(I2Cx);
}


/**
 * @brief RxNe Not Empty Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void RXNE_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    if(I2C_Get_FlagStatus(I2Cx, I2C_SR2_MSL))
    {
        // For Master
    }else
    {
        if(I2C_Get_FlagStatus(I2Cx, I2C_SR2_TRA)) // if Transmitter Mode 
        {
        }else // if Receiver Mode
        {
            I2C_Slave_Read_IT(I2Cx);
        }
    }
    UNUSED(I2Cx);
}


/**
 * @brief Overrun  Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void OVR_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    UNUSED(I2Cx);
}


/**
 * @brief Timeout Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void TIMEOUT_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    UNUSED(I2Cx);
}

/**
 * @brief Acknowledge Interrupt defualt CallBacks
 * @param I2Cx : data Structure for I2C API
 */
__weak void AF_CallBack_I2C(struct _St_I2C_API *I2Cx)
{
    if((I2Cx->I2C_Inst->I2C_SR2 & I2C_SR2_MSL) == I2C_SR2_MSL)
    {
        // For master
    }else
    {
        I2Cx->I2C_Inst->I2C_SR1 &= ~(I2C_SR1_AF);
    }
    UNUSED(I2Cx);
}

/**
 * @brief This function handles I2C1 Event global interrupt.
 */
void I2C1_EV_Handler(void)
{
    if((I2C1->I2C_SR1 & I2C_SR1_SB) == I2C_SR1_SB)
        i2c1_config.P_SB_CallBack(&i2c1_config);
    else if((I2C1->I2C_SR1 & I2C_SR1_ADDR) == I2C_SR1_ADDR)
        i2c1_config.P_ADDR_CallBack(&i2c1_config);
    else if((I2C1->I2C_SR1 & I2C_SR1_ADD10) == I2C_SR1_ADD10)
        i2c1_config.P_ADDR10_CallBack(&i2c1_config);
    else if((I2C1->I2C_SR1 & I2C_SR1_STOPF) == I2C_SR1_STOPF)
        i2c1_config.P_STOPF_CallBack(&i2c1_config);
    else if((I2C1->I2C_SR1 & I2C_SR1_BTF) == I2C_SR1_BTF)
        i2c1_config.P_BTF_CallBack(&i2c1_config);
    if((I2C1->I2C_CR2 & I2C_CR2_ITBUFEN) == I2C_CR2_ITBUFEN)
    {
        if((I2C1->I2C_SR1 & I2C_SR1_TXE) == I2C_SR1_TXE)
            i2c1_config.P_TXE_CallBack(&i2c1_config);
        else if((I2C1->I2C_SR1 & I2C_SR1_RXNE) == I2C_SR1_RXNE)
            i2c1_config.P_RXNE_CallBack(&i2c1_config);
    }
    
}   


/**
 * @brief This function handles I2C1 Error global interrupt. 
 */
void I2C1_ER_Handler(void)
{

}


/**
 * @brief This function handles I2C2 Event global interrupt.
 */
void I2C2_EV_Handler(void)
{
    if((I2C2->I2C_SR1 & I2C_SR1_SB) == I2C_SR1_SB)
        i2c2_config.P_SB_CallBack(&i2c2_config);
    else if((I2C2->I2C_SR1 & I2C_SR1_ADDR) == I2C_SR1_ADDR)
        i2c2_config.P_ADDR_CallBack(&i2c2_config);
    else if((I2C2->I2C_SR1 & I2C_SR1_ADD10) == I2C_SR1_ADD10)
        i2c2_config.P_ADDR10_CallBack(&i2c2_config);
    else if((I2C2->I2C_SR1 & I2C_SR1_STOPF) == I2C_SR1_STOPF)
        i2c2_config.P_STOPF_CallBack(&i2c2_config);
    else if((I2C2->I2C_SR1 & I2C_SR1_BTF) == I2C_SR1_BTF)
        i2c2_config.P_BTF_CallBack(&i2c2_config);
    if((I2C2->I2C_CR2 & I2C_CR2_ITBUFEN) == I2C_CR2_ITBUFEN)
    {
        if((I2C2->I2C_SR1 & I2C_SR1_TXE) == I2C_SR1_TXE)
            i2c2_config.P_TXE_CallBack(&i2c2_config);
        else if((I2C2->I2C_SR1 & I2C_SR1_RXNE) == I2C_SR1_RXNE)
            i2c2_config.P_RXNE_CallBack(&i2c2_config);
    }
    
}


/**
 * @brief This function handles I2C1 Error global interrupt.
 */
void I2C2_ER_Handler(void)
{

}





//==============================================================================


//________________________ Local Functions Definition __________________________
/**
 * @brief Is Used to config Pins for I2C peripheral
 * @param I2Cx : data Structure for I2C API
 * @return      uint8_t  : 1 = Succesed
 *                         0 = Failed
 */
uint8_t I2C_Clock_Config_Pins(St_I2C_API *I2Cx)
{
    GPIO_InitTypeDef gpio_config = {0};
    gpio_config.Mode = GPIO_MODE_AF_OD;
    gpio_config.Speed = GPIO_SPEED_FREQ_10MHZ;
    if(I2Cx->I2C_Inst == I2C1)
    {   
        __APB1ENR_I2C1EN_EN();
        
        // Config The SCL
        gpio_config.Pin = GPIO_PIN_6;
        Init_GPIO(GPIOB, &gpio_config);
        
        // Config The SDA
        gpio_config.Pin = GPIO_PIN_7;
        Init_GPIO(GPIOB, &gpio_config);
    }else
    {
        __APB1ENR_I2C1EN_EN();

          // Config The SCL
        gpio_config.Pin = GPIO_PIN_10;
        Init_GPIO(GPIOB, &gpio_config);
        
        // Config The SDA
        gpio_config.Pin = GPIO_PIN_11;
        Init_GPIO(GPIOB, &gpio_config);
    }

    return 1;
}
//==============================================================================